---
kind: method
id: M:Autodesk.Revit.ApplicationServices.Application.GetFailureDefinitionRegistry
source: html/bc9ff9b9-5d87-1632-4a59-c3b5fd9cda25.htm
---
# Autodesk.Revit.ApplicationServices.Application.GetFailureDefinitionRegistry Method

Returns the instance of FailureDefinitionRegistry.

## Syntax (C#)
```csharp
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
```

## Returns
The instance of FailureDefinitionRegistry.